# Створення прикладних програм на мові Python
# Лабораторна робота №2
# Гошовський Іван, №Заліковки
from math import *
print ('[1] Створення прикладних програм на мові Python, Лабораторна №3')
print ('[2] Гошовський Іван, №Заліковки')
print('[3] Введіть:')
a = float(input('	a = '))
b = float(input('	b = '))
if not(2*a+b) or not(cos(b)):
	print('Значення змінних виходять за область визначення функції!')
else:
	res = (a - 2) / (2 * a + b) + sin(3 * a) / cos(b)
	print('Результат обчислення = ', res)
