# Створення прикладних програм на мові Python
# Лабораторна робота №4
# Гошовський Іван, №Заліковки
print ('[1] Створення прикладних програм на мові Python, Лабораторна #4.1')
print ('[2] Гошовський Іван, №Заліковки')
a = int(input ('[3]	Введіть: a = '))
x1 = 2
epsilon = 10E-4
if a < 0:
	print('	Число повинне бути додатнім!')
else:
	while  True:
		x2 = (x1 + a / x1) / 2
		if abs(x2 - x1) < epsilon:
			break
		else:
			x1 = x2
print("Корінь від 'a' за ітараційною формулою Герона: а = ", x2)