import os
import shutil
text = '''Програми на Python виконують дії, які приймають форму операцій над об'єктами (наприклад, складання або конкатенація), над якими виконуються операції.
В Python використовують динамічну типізацію (типи даних визначаються автоматично, їх не потрібно оголошувати в програмному коді), але при цьому він є мовою із чіткою типізацією (ви зможете виконувати над об'єктом тільки ті операції, які застосовані до його типу).
Можна створювати власні типи об'єктів: вбудовані компоненти є стандартними складовими Python, тому вони завжди залишаються незмінними; власні структури мають властивість змінюватися від випадку до випадку. '''
f = open('v6.txt', 'w', encoding='utf-8')
f.write(text)
f.close()
os.rename('v6.txt', '6.txt')
f = open ('6.txt', 'r',encoding='utf-8')
line = f.readlines()
f.close()
os.rename('6.txt', '61.txt')
f = open('61.txt','w', encoding='utf-8')
for x in line:
	x = x.split()
	res = x[0] + ' ' + x[1] + ' ' + x[2]+'\n'
	f.writelines(res)
f.close()
f = open('62.txt', 'w', encoding='utf-8')
word = text.split()
for w in word:
	if len(w)%2 == 0:
		f.write(w + ' ')
f.close()   
